{
    "_id": {
        "$oid": "67e101f6ca74b7be23c06286"
    },
    "companyId": "67e04d18564141846617d797",
    "tableId": "67e0476b564141846617d77b",
    "companyName": "Hack",
    "basicInfo": {
        "description": "Hexaware Technologies IPO is a book built issue of Rs 8,750.00 crores. The issue is entirely an offer for sale of 12.36 crore shares.\n\nHexaware Technologies IPO bidding started from February 12, 2025 and ended on February 14, 2025. The allotment for Hexaware Technologies IPO was finalized on Monday, February 17, 2025. The shares got listed on BSE, NSE on February 19, 2025.\n\nHexaware Technologies IPO price band is set at ₹708 per share. The minimum lot size for an application is 21. The minimum amount of investment required by retail investors is ₹14,154. But it is suggested to the investor to bid at the cutoff price to avoid the oversubscription senerio, which is about to ₹14,868. The minimum lot size investment for sNII is 14 lots (294 shares), amounting to ₹2,08,152, and for bNII, it is 68 lots (1,428 shares), amounting to ₹10,11,024.\n\nThe issue includes a reservation of up to 1404056 shares for employees offered at a discount of Rs 67.00 to the issue price.\n\nKotak Mahindra Capital Company Limited, Citigroup Global Markets India Private Limited, J.P. Morgan India Private Limited, Hsbc Securities & Capital Markets Pvt Ltd, Iifl Securities Ltd are the book running lead managers of the Hexaware Technologies IPO, while Kfin Technologies Limited is the registrar for the issue.\n\nRefer to  Hexaware Technologies IPO RHP for detailed information.",
        "industry": "Finance",
        "founded": "2010",
        "headquarters": "Delhi",
        "ceo": "Manoj Kumar",
        "employees": "150",
        "website": "https://www.chittorgarh.com/ipo/hexaware-technologies-ipo/1985/"
    },
    "logo": {
        "url": "https://www.chittorgarh.net/images/ipo/hexaware-ipo-logo.jpg",
        "alt": "Logo"
    },
    "images": [
        {
            "url": "https://www.chittorgarh.net/images/ipo/hexaware-ipo-logo.jpg",
            "caption": "Logo Image"
        }
    ],
    "tables": [
        {
            "title": "Hexaware Technologies IPO Details",
            "data": [
                {
                    "IPO Date": "Listing Date",
                    "February 12, 2025 to February 14, 2025": "February 19, 2025"
                },
                {
                    "IPO Date": "Face Value",
                    "February 12, 2025 to February 14, 2025": "₹1 per share"
                },
                {
                    "IPO Date": "Issue Price",
                    "February 12, 2025 to February 14, 2025": "₹708 per share"
                },
                {
                    "IPO Date": "Lot Size",
                    "February 12, 2025 to February 14, 2025": "\t21 Shares"
                },
                {
                    "IPO Date": "Total Issue Size",
                    "February 12, 2025 to February 14, 2025": "12,35,87,570 shares"
                }
            ]
        },
        {
            "title": "Hexaware Technologies IPO Timeline (Tentative Schedule)",
            "data": [
                {
                    "Application": "Retail (Min)",
                    "Lots": "1",
                    "Shares": "21",
                    "Amount": "₹14,868"
                },
                {
                    "Application": "Retail (Max)",
                    "Lots": "13",
                    "Shares": "273",
                    "Amount": "₹1,93,284"
                },
                {
                    "Application": "S-HNI (Min)",
                    "Lots": "14",
                    "Shares": "\t294",
                    "Amount": "₹2,08,152"
                }
            ]
        }
    ],
    "links": [
        {
            "title": "Official Website",
            "url": "https://hackintown-website.vercel.app/",
            "type": "website"
        },
        {
            "title": "Telegram",
            "url": "t.me/hackintown",
            "type": "social"
        }
    ],
    "content": [
        {
            "title": "About Hexaware Technologies Limited",
            "body": "Incorporated in 1992, Hexaware Technologies Limited is engaged in the business of global digital and technology services with artificial intelligence.\n\nThe company uses technology to offer innovative solutions, integrating AI to help customers adapt, innovate, and improve in the AI-driven world.\n\nThe company has major offshore delivery centers in India (Chennai, Pune, Bengaluru, Noida, etc.) and Sri Lanka. It plans expansion into Tier 2 cities and aims to open new centers in Ahmedabad.\n\nAs of September 30, 2024, the company has a global delivery presence with 39 centers and 16 offices across the Americas, Europe, and APAC.\n\nBusiness Segment: The company provides services in its operating segments across six industries Financial Services, Healthcare & and; Insurance, Manufacturing & and; Consumer, Hi-Tech & and; Professional Services, Banking, and Travel & and Transportation.",
            "order": 0
        },
        {
            "title": "Hexaware Technologies IPO Review (Apply)",
            "body": "[Dilip Davda]  HTL is one of the leading players in AI-enabled digital solutions provider from India. It marked steady growth in its top and bottom lines for the reported periods. It has evolved growing set of offerings in the last decade and is thus enjoying prime place in innovative solutions globally. Based on recent financial performance, the issue appears fully priced. Well-informed investors may park funds for medium to long term, in this dividend paying company. Read detail review...",
            "order": 1
        },
        {
            "title": "Hexaware Technologies IPO Subscription Status (Bidding Detail)",
            "body": "The Hexaware Technologies IPO is subscribed 2.79 times on February 14, 2025 5:42:47 PM (Day 3). The public issue subscribed 0.11 times in the retail category, 9.55 times in the QIB category, and 0.21 times in the NII category. Check Day by Day Subscription Details (Live Status)\n\nCategory\tSubscription (times)\tShares Offered\tShares bid for\nQIB\t9.55\t2,44,63,278\t23,36,61,582\nNII\t0.21\t1,83,47,458\t39,48,924\n    bNII (bids above ₹10L)\t0.24\t1,22,31,638\t29,58,816\n    sNII (bids below ₹10L)\t0.16\t61,15,819\t9,90,108\nRetail\t0.11\t4,28,10,734\t47,64,102\nEmployee\t0.33\t14,04,056\t4,70,358\nTotal\t2.79\t8,70,25,526\t24,28,44,966\n",
            "order": 2
        }
    ],
    "reviews": [
        {
            "title": "Hexaware Technologies IPO Review Summary from brokers and analysts",
            "content": "",
            "rating": 5,
            "author": "Mk",
            "date": "2025-03-24",
            "type": "table",
            "listItems": [],
            "tableData": [
                {
                    "Review By": "Count",
                    "Apply": "6",
                    "May Apply": "19",
                    "Neutral": "2",
                    "Avoid": "0",
                    "Not Rated": "0"
                },
                {
                    "Review By": "%",
                    "Apply": "66.67",
                    "May Apply": "11.11",
                    "Neutral": "11.11",
                    "Avoid": "0",
                    "Not Rated": "0"
                }
            ]
        }
    ],
    "news": [
        {
            "title": "Hexaware Falls 16 Per Cent From Record High, Hits All-Time Low; Nears Issue Price",
            "url": "https://www.msn.com/en-in/money/economy/hexaware-falls-16-per-cent-from-record-high-hits-all-time-low-nears-issue-price/ar-AA1BmKcK",
            "date": "2025-03-24",
            "time": "12:36",
            "description": "Mumbai: Hexaware Technologies' share price dropped sharply on Friday, March 21, falling 2 per cent in intraday trading to touch a new low of Rs 715 on the BSE. This decline follows a cautious demand outlook for the IT services sector shared by global consultancy firm Accenture.",
            "content": "The stock price dipped below its previous low of Rs 720 recorded on March 17, 2025, making it the lowest level since the company’s listing on February 19, 2025. Hexaware has now corrected 16 per cent from its all-time high of Rs 850, reached on February 27, 2025. The stock is now trading close to its issue price of Rs 708 per share.\n\nHowever, by 1:50 PM, Hexaware rebounded slightly from its intraday low and was trading nearly 1 per cent higher at Rs 729.80. Meanwhile, the broader market was performing better, with the BSE Sensex rising 0.70 per cent to reach 76,882.\n\nSignature Global Shares Zoom 8%, Acquires Prime Land In Gurugram\n\nAccenture’s Cautious Outlook Weighs on IT Stocks\n\nOn Thursday, Accenture reported positive year-on-year (Y-o-Y) revenue growth and raised its Q3 and FY25 revenue guidance. However, the company maintained a cautious stance on the overall market. The upper end of Accenture’s full-year growth forecast remained at 7 per cent, signaling concerns about the macroeconomic environment. Additionally, Accenture slightly reduced its upper band margin guidance to 15.7 per cent for FY25, as per a note by ICICI Securities.\n\nShriram FD for Shared Dreams\nShriram Finance Limited\nShriram FD for Shared Dreams\nAd\nHexaware Underperforms Market\n\nIn the past two weeks, Hexaware’s stock has underperformed the broader market, dropping 13 per cent. This decline follows the company’s financial results for the December 2024 quarter, where it reported 0.2 per cent quarter-on-quarter (Q-o-Q) revenue growth in constant currency (CC) terms. This was below market expectations due to a higher-than-expected base in Q3 and a 70 basis points (bps) impact from furloughs.\n\nIndusInd Bank Orders Independent Probe, RBI Reassures Depositors\n\nDespite this, the company’s Y-o-Y growth remained strong at 18.5 per cent. Analysts at JM Financial Institutional Securities noted that cost advantages from lower compensation expenses in H2CY23 and inorganic contributions helped mitigate the slowdown. However, EBITDA margins (excluding other income) still missed estimates by 50 bps.",
            "source": "https://www.msn.com/en-in/money/economy/hexaware-falls-16-per-cent-from-record-high-hits-all-time-low-nears-issue-price/ar-AA1BmKcK",
            "order": 0
        },
        {
            "title": "Mobikwik, IKS, Ola, Hexaware from IPO index tank up to 15%, record new lows",
            "url": "https://www.business-standard.com/markets/news/mobikwik-iks-ola-hexaware-from-ipo-index-tank-up-to-15-record-new-lows-125031700196_1.html",
            "date": "2025-03-24",
            "time": "12:37",
            "description": "Shares of One Mobikwik Systems (Mobikwik), Inventurus Knowledge Solutions (IKS), Ola Electric Mobility (Ola), Hexaware Technologies and Awfis Space Solutions tanked up to 15 per cent on the BSE in Monday’s intra-day trade amid heavy volumes in an otherwise firm market.",
            "content": " \nBesides IKS, Mobikwik, Ola, Hexaware Technologies, a total of 9 stocks from the BSE IPO index hit their respective new lows in intra-day trade today. The list includes Ceigall India, Emcure Pharmaceuticals, Gopal Snacks, Quality Power Electrical Equipments (QPower), Saraswati Saree Depot and Western Carriers (India).\n \nAt 10:01 AM; the BSE IPO index was down 0.6 per cent at 12,921.79, as compared to 0.63 per cent rise in the BSE Sensex. The IPO index has corrected 25 per cent from its 52-week high of 17,281 touched on September 29, 2024. Thus far in the calendar year 2025, the BSE IPO index has underperformed the market by falling 22 per cent. In comparison, the BSE Sensex was down 5.4 per cent during the same period.",
            "source": "https://www.business-standard.com/markets/news/mobikwik-iks-ola-hexaware-from-ipo-index-tank-up-to-15-record-new-lows-125031700196_1.html",
            "order": 1
        }
    ],
    "createdAt": "2025-03-24T06:55:50.747Z",
    "updatedAt": "2025-03-24T06:55:50.747Z"
}